#-*- coding: utf-8 -*-
'''
Created on 2016年1月19日

@author: 11876
'''

areaType={'':'','20':'县','21':'乡/镇/街道','22':'村/社区','23':'组'}
#行政区域

orgType={'':'','13':'县/区卫计委','60':'县级医院','61':'乡镇卫生院/街道卫生服务中心','62':'村卫生室/社区卫生站'}
# 医疗机构代码

genderCode={'':'','0':'未知的性别','1':'男','2':'女','9':'未知的性别'}
# 性别

residentType={'':'','1':'户籍','2':'非户籍'}
# 常住类型代码

ethnicityCode={'':'','1':'汉族','2':'少数民族'}
# 民族代码

bloodGroupCode={'':'','1':'A型','2':'B型','3':'O型','4':'AB型','5':'不详'}
# 血型代码

rhBloodGroupCode={'':'','1':'否','2':'是','3':'不详'}
# RH 阴性代码

eduBGCode={'':'','1':'文盲及半文盲','2':'小学','3':'初中','4':'高中/技校/中专','5':'大学专科及以上','6':'不详'}
# 文化程序代码

occupationCode={'':'','1':'国家机关、党群组织、企业、事业单位负责人','2':'专业技术人员','3':'办事人员和有关人员','4':'商业、服务业人员','5':'农、林、牧、渔、水利业生产人员','6':'生产、运输设备操作人员及有关人员'}
# 职业代码

maritalStatusCode={'':'','1':'未婚','2':'已婚','3':'丧偶','4':' 离婚','5':'未说明的婚姻状况'}
# 婚姻状况代码

paymentMethodCodes={'':'','1':'城镇职工基本医疗保险','2':'城镇居民基本医疗保险','3':'新型农村合作医疗','4':'贫困救助','5':'商业医疗保险','6':'全公费','7':'全自费','8':'其他'}
# 医疗费用支付方式代码

drugAllergyHistoryCodes={'':'','1':'无','2':'青霉素','3':'磺胺','4':'链霉素','5':'其他'}
# 药物过敏史代码  多选

exposureHistoryCodes={'':'','1':'无','2':'化学品','3':'毒物','4':'射线'}
# 暴露史代码  多选

familyHistoryFatherCodes={'':'','1':'无','2':'高血压','3':'糖尿病','4':'冠心病','5':'慢性阻塞性肺疾病','6':'恶性肿瘤','7':' 脑卒中','8':'重性精神疾病','9':'结核病'}
# 家族疾病史代码-父亲  多选

familyHistoryMatherCodes={'':'','1':'无','2':'高血压','3':'糖尿病','4':'冠心病','5':'慢性阻塞性肺疾病','6':'恶性肿瘤','7':' 脑卒中','8':'重性精神疾病','9':'结核病','10':'肝炎','11':'先天畸形','12':'其他'}
# 家族疾病史代码-母亲  多选

brotherAndSisterCodes={'':'','1':'无','2':'高血压','3':'糖尿病','4':'冠心病','5':'慢性阻塞性肺疾病','6':'恶性肿瘤','7':' 脑卒中','8':'重性精神疾病','9':'结核病','10':'肝炎','11':'先天畸形','12':'其他'}
# 家族疾病史代码-兄弟姐妹  多选

familyHistoryChildrenCodes={'':'','1':'无','2':'高血压','3':'糖尿病','4':'冠心病','5':'慢性阻塞性肺疾病','6':'恶性肿瘤','7':' 脑卒中','8':'重性精神疾病','9':'结核病','10':'肝炎','11':'先天畸形','12':'其他'}
# 家族疾病史代码-子女  多选

geneticHistoryCode={'':'','1':'无','2':'有'}
# 遗传病史代码代码 

disabilityCodes={'':'','1':'无残疾','2':'视力残疾','3':'听力残疾','4':'言语残疾','5':'肢体残疾','6':'智力残疾','7':'精神残疾','8':'其他残疾'}
# 残疾情况代码 多选

kitchenExhaustCode={'':'','1':'无','2':'油烟机','3':'换气扇','4':'烟囱'}
#厨房排风设施代码

fuelTypeCode={'':'','1':'液化气','2':'煤','3':'天然气','4':'沼气','5':'柴火','6':'其他'}
# 燃料类型代码

waterCode={'':'','1':'自来水','2':'经净化过滤的水','3':'井水','4':'河湖水','5':'塘水','6':'其他'}
# 饮水代码

toiletCode={'':'','1':'卫生厕所','2':'一格或二格粪池式','3':'马桶','4':'露天粪坑','5':'简易棚厕'}
# 厕所代码

livestockColumnCode={'':'','1':'单设','2':'室内','3':'室外'}
# 禽畜栏代码


pastHistoryType={'':'','1':'疾病','2':'手术','3':'外伤','4':'输血',}
# 既往史类型

pastHistoryCode_ill={'':'','1':'无','2':'高血压','3':'糖尿病','4':'冠心病','5':'慢性阻塞性肺疾病','6':'恶性肿瘤','7':'脑卒中','8':'重型精神疾病','9':'结核病','10':'肝炎','11':'其他法定传染病','12':'职业病','13':'其他'}
# 既往史疾病代码  既往史类型为疾病的时候

pastHistoryCode_other={'':'','1':'无','2':'有'}
# 既往史疾病代码  既往史类型为2/3/4的时候


symptomCodes={'':'','1':'无症状','2':'头痛','3':'头晕','4':'心悸','5':'胸闷','6':'胸痛','7':'慢性咳嗽','8':'咳痰','9':'呼吸困难','10':'多饮','11':'多尿','12':'体重下降',
              '13':'乏力','14':'关节肿痛','15':'视力模糊','16':'手脚麻木','17':'尿急','18':'尿痛','19':'便秘','20':'腹泻','21':'恶心呕吐','22':'眼花','23':'耳鸣','24':'乳房胀痛','25':'其他',}
# 症 状 代 码（多选）

theAgedStatus={'':'','1':'满意','2':'基本满意','3':'说不清楚','4':'不太满意','5':'不满意'}
# 老 年 人 健康 状 态 自我 评 估 代码

selfCareAbilityCode={'':'','1':'可自理','2':'轻度依赖','3':'中度依赖','4':'不能自理'}
# 老 年 人 生活 自 理 能力 自 我 评估
cognitiveFunction={'':'','1':'粗筛阴性','2':'粗筛阳性'}
# 老 年 人 认知功能

emotionalState={'':'','1':'粗筛阴性','2':'粗筛阳性'}
# 老 年 人 情感状态
exerciseFrequencyCode={'':'','1':'每天','2':'每周一次以上','3':'偶尔','4':'不锻炼'}
# 体 育 锻 炼频率代码

eatingHabitsCodes={'':'','1':'荤素均衡','2':'荤食为主','3':'素食为主','4':'嗜盐','5':'嗜油','6':'嗜糖'}
# 饮 食 习 惯 （多选），

smokingStatusCode={'':'','1':'从不吸烟','2':'已戒烟','3':'吸烟'}
# 吸 烟 状 况代码

drinkingFrequencyCode={'':'','1':'从不','2':'偶尔','3':'经常','4':'每天',}
# 饮 酒 频 率代码

temperanceCode={'':'','1':'未戒酒','2':'已戒酒'}
# 是否戒酒

whetherDrunk={'':'','1':'是','2':'否'}
#近一年是否醉酒

alcoholTypeCodes={'':'','1':'白酒','2':'啤酒','3':'红酒','4':'黄酒','5':'其他',}
# 饮 酒 种 类代 码 （多选），

exposureStateCode={'':'','1':'无','2':'有'}
# 是 否 有 职业 暴 露 情况

dustProtective={'':'','1':'无','2':'有'}
# 粉尘-防护措施

radiogenProtective={'':'','1':'无','2':'有'}
# 放射物质-防护措施

physicalProtective={'':'','1':'无','2':'有'}
# 物理因素-防护措施

chemistryProtective={'':'','1':'无','2':'有'}
# 化学物质-防护措施

otherProtective={'':'','1':'无','2':'有'}
# 其他-防护措施

lipsCode={'':'','1':'红润','2':'苍白','3':'发绀','4':'皲裂','5':'疱疹'}
# 口唇代码

dentitionCodes={'':'','1':'正常','2':'缺齿','3':'龋齿','4':'义齿（假牙）',}
# 齿 列 （ 多选），

throatCode={'':'','1':'无充血','2':'充血','3':'淋巴滤泡增生',}
# 咽部代码

hearingCode={'':'','1':'听见','2':'听不清或无法听见'}
# 听力代码

motorFunctionCode={'':'','1':'可顺利完成','2':'无法独立完成其中任何一个动作'}
# 运 动 功 能 代码

fundusCode={'':'','1':'正常','2':'异常'}
# 眼底代码

skinCode={'':'','1':'正常','2':'潮红','3':'苍白','4':'发绀','5':'黄染','6':'色素沉着','7':'其他',}
# 皮肤代码

scleraCode={'':'','1':'正常','2':'黄染','3':'充血','4':'其他',}
# 巩膜代码

lymphNodeCode={'':'','1':'未触及','2':'锁骨上','3':'腋窝','4':'其他',}
# 淋 巴 结 代码

barrelChestCode={'':'','1':'否','2':'是'}
# 肺-桶状胸

breathSoundCode={'':'','1':'正常','2':'异常'}
# 肺 -呼吸音代码

raleCode={'':'','1':'无','2':'干罗音','3':'湿罗音','4':'其他'}
# 肺 -罗音代码

rhythmCode={'':'','1':'齐','2':'不齐','3':'绝对不齐'}
# 心脏 -心律情况

cardiacSouffleCode={'':'','1':'无','2':'有'}
# 心脏-杂音

abdomenTendernessCode={'':'','1':'无','2':'有'}
# 腹部-压痛

abdomenMassCode={'':'','1':'无','2':'有'}
# 腹部-包块

abdomenLiverCode={'':'','1':'无','2':'有'}
# 腹部-肝大

abdomenSplenomegalyCode={'':'','1':'无','2':'有'}
# 腹部-脾大

abdomenShiftingDullnessCode={'':'','1':'无','2':'有'}
# 腹部 -移动性浊音

legEdemaCode={'':'','1':'无','2':'单侧','3':'双侧不对称','4':'双侧对称'}
# 下肢水肿

dorsalisPedisPulseCode={'':'','1':'未触及','2':'触及双侧对称','3':'触及左侧弱或消失','4':'触及右侧弱或消失'}
# 足 背 动 脉搏动

analFingerCodes={'':'','1':'未及异常','2':'触痛','3':'包块','4':'前列腺异常','5':'其他'}
# 肛 门 指 诊代 码

breastCodes={'':'','1':'未见异常','2':'乳房切除','3':'异常泌乳','4':'乳腺包块','5':'其他'}
# 乳 腺 代 码（多选），

vulvaCode={'':'','1':'未见异常','2':'异常'}
# 妇科 -外阴代码

vaginaCode={'':'','1':'未见异常','2':'异常'}
# 妇科 -阴道代码

cervixCode={'':'','1':'未见异常','2':'异常'}
# 妇科 -宫颈代码

uterusCode={'':'','1':'未见异常','2':'异常'}
# 妇科 -宫体代码

uterineAccessoriesCode={'':'','1':'未见异常','2':'异常'}
# 妇科 -附件代码

urineProteinCode={'':'','0':'-','1':'±','2':'+','3':'++','4':'+++','5':'++++'}
# 尿常规 -尿蛋白

urineSugarCode={'':'','0':'-','1':'±','2':'+','3':'++','4':'+++','5':'++++'}
# 尿常规 -尿糖

urineKetoneCode={'':'','0':'-','1':'±','2':'+','3':'++','4':'+++','5':'++++'}
# 尿常规 -尿酮体

urineOccultBloodCode={'':'','0':'-','1':'±','2':'+','3':'++','4':'+++','5':'++++'}
# 尿常规 -尿潜血
ECGCode={'':'','1':'正常','2':'异常'}
# 心 电 图 代码

fecalOccultBloodCode={'':'','1':'阴性','2':'阳性'}
# 大便潜血

HBsAgCode={'':'','1':'阴性','2':'阳性'}
# 乙 型 肝 炎表面抗原

chestXRayCode={'':'','1':'正常','2':'异常'}
# 胸部 X线片代码

BScanCode={'':'','1':'正常','2':'异常'}
# B 超代码

papSmearCode={'':'','1':'正常','2':'异常'}
# 宫 颈 涂 片代码

flatAndQualityCode={'':'','1':'是','2':'基本是'}
# 中 医 平 和质代码

qiDeficiencyCode={'':'','1':'是','2':'倾向是'}
# 中 医 气 虚质代码

yangXuzhiCode={'':'','1':'是','2':'倾向是'}
# 中 医 阳 虚质代码

yinDeficiencyCode={'':'','1':'是','2':'倾向是'}
# 中 医 阴 虚质代码

phlegmDampnessQualityCode={'':'','1':'是','2':'倾向是'}
# 中 医 痰 湿质代码

hotAndHumidQualityCode={'':'','1':'是','2':'倾向是'}
# 中 医 湿 热质代码

bloodStasisCode={'':'','1':'是','2':'倾向是'}
# 中 医 血 瘀质代码

qiStagnationCode={'':'','1':'是','2':'倾向是'}
# 中 医 气 郁质代码

specialQualityCode={'':'','1':'是','2':'倾向是'}
# 中 医 特 秉质代码

cerebrovascularCodes={'':'','1':'未发现','2':'缺血性卒中','3':'脑出血','4':'蛛网膜下腔出血','5':'短暂性脑缺血发作','6':'其他'}
# 脑 血 管 疾病代码

kidneyDiseaseCodes={'':'','1':'未发现','2':'糖尿病肾病','3':'肾功能衰竭','4':'急性肾炎','5':'慢性肾炎','6':'其他'}
# 肾 脏 疾 病代 码

heartDiseaseCodes={'':'','1':'未发现','2':'心肌梗死','3':'心绞痛','4':'冠状动脉血运重建','5':'充血性心力衰竭','6':'心前区疼痛','7':'其他'}
# 心 脏 疾 病代 码

vascularDiseaseCodes={'':'','1':'未发现','2':'夹层动脉瘤','3':'动脉闭塞性疾病','4':'其他'}
# 血 管 疾 病代 码

eyeDiseaseCodes={'':'','1':'未发现','2':'视网膜出血或渗出','3':'视乳头水肿','4':'白内障','5':'其他'}
# 眼 部 疾 病代 码

nerveSystemDiseaseCode={'':'','1':'未发现','2':'有'}
# 神 经 系 统疾病代码

otherSystemDiseaseCode={'':'','1':'未发现','2':'有'}
# 其 他 系 统疾病代码

healthEvaluationCode={'':'','1':'体检无异常','2':'有异常'}
# 健康评价

healthGuidanceCodes={'':'','1':'纳入慢性病患者健康管理','2':'建议复查','3':'建议转诊','4':'定期随访'}
# 健 康 指 导代 码

riskFactorsCodes={'':'','1':'戒烟','2':'健康饮酒','3':'饮食','4':'锻炼','5':'减体重','6':'建议接种疫苗','7':'其他',}
# 危 险 因 素控 制 代 码

doseCode={'':'','1':'规律','2':'间断','3':'不服药'}
# 服药依从性代码
